src/pdstemplates/QUPA_IN000005UK03.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:hl7="urn:hl7-org:v3">
  <SOAP-ENV:Header>
    <wsa:MessageID>uuid:25F886B2-873F-4AE6-961C-9A98BA246D00</wsa:MessageID>
    <wsa:Action>urn:nhs:names:services:pdsquery/QUPA_IN000005UK03</wsa:Action>
    <wsa:To>https://msg.dev.spine2.ncrs.nhs.uk/sync-service</wsa:To>
    <wsa:From>
      <wsa:Address>fe80::e090:7384:2cc5:9b80%42</wsa:Address>
    </wsa:From>
    <hl7:communicationFunctionRcv>
      <hl7:device>
        <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="928942012545"/>
      </hl7:device>
    </hl7:communicationFunctionRcv>
    <hl7:communicationFunctionSnd>
      <hl7:device>
        <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="200000000079"/>
      </hl7:device>
    </hl7:communicationFunctionSnd>
    <wsa:ReplyTo>
      <wsa:Address>fe80::e090:7384:2cc5:9b80%42</wsa:Address>
    </wsa:ReplyTo>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <QUPA_IN000005UK03 xmlns="urn:hl7-org:v3">
      <id root="7CBCD843-C011-4DF9-962C-2E9BDE2F334C"/>
      <creationTime value="20150924100035"/>
      <versionCode code="V3NPfIT4.2.00"/> 
      <interactionId extension="QUPA_IN000005UK03" root="2.16.840.1.113883.2.1.3.2.4.12"/>
      <processingCode code="P"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <communicationFunctionRcv>
        <device classCode="DEV" determinerCode="INSTANCE">
          <id extension="928942012545" root="1.2.826.0.1285.0.2.0.107"/>
        </device>
      </communicationFunctionRcv>
      <communicationFunctionSnd>
        <device classCode="DEV" determinerCode="INSTANCE">
          <id extension="200000000079" root="1.2.826.0.1285.0.2.0.107"/>
        </device>
      </communicationFunctionSnd>
      <ControlActEvent classCode="CACT" moodCode="EVN">
        <author1 typeCode="AUT">
          <AgentSystemSDS classCode="AGNT">
            <agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
              <id extension="200000000079" root="1.2.826.0.1285.0.2.0.107"/>
            </agentSystemSDS>
          </AgentSystemSDS>
        </author1>
        <query>
          <person.administrativeGenderCode>
            <semanticsText>Person.administrativeGenderCode</semanticsText>
            <value code="{{genderCode}}"/>
          </person.administrativeGenderCode>
          <person.birthTime>
            <semanticsText>Person.birthTime</semanticsText>
            <value value="{{dateOfBirth}}" />
          </person.birthTime>
          <person.name>
            <semanticsText>Person.name</semanticsText>
            <value>
              <family>{{familyName}}</family>
              <given>{{givenName}}</given>
            </value>
          </person.name>
        </query>
      </ControlActEvent>
    </QUPA_IN000005UK03>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>